#### PANDAS DATAFRAMES

#### 1. How to create a Table (dataframe)

In [3]:
# 1. Import the necesarry library
import pandas as pd

In [4]:
# How to initialize an empty dataframe in an Table
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

#### 2. How to create a dataframe from a list(s)

In [6]:
A_list = [112,124,162,106,137,168]

In [7]:
df1 = pd.DataFrame(A_list)

In [8]:
df1

     0
0  112
1  124
2  162
3  106
4  137
5  168

#### 3. add column to label to a dataframe

In [10]:
df2 = pd.DataFrame(A_list, columns = ['Total'])
df2

   Total
0    112
1    124
2    162
3    106
4    137
5    168

In [11]:
students = [['Victor', 25, 'Single','Male'],['Martin',26,'Married','Male'],['Linda',19,'Maried','Female']]
students_df = pd.DataFrame(students, columns = ['First_name','Age','Marital_status','Gender'])
students_df

  First_name  Age Marital_status  Gender
0     Victor   25         Single    Male
1     Martin   26        Married    Male
2      Linda   19         Maried  Female

#### 4. How to retrieve a column from a DataFrame

In [13]:
students_df['Gender']

0      Male
1      Male
2    Female
Name: Gender, dtype: object

#### 5. How to retrieve multiple columns from a DataFrame

In [15]:
students_df[['Marital_status','Age','Gender']]

  Marital_status  Age  Gender
0         Single   25    Male
1        Married   26    Male
2         Maried   19  Female

#### 5. How to retrieve the table headers/column name

In [17]:
students_df.columns

Index(['First_name', 'Age', 'Marital_status', 'Gender'], dtype='object')

In [18]:
new_column_name = ['Name','How_old?','Married','Sex']
students_df.columns = new_column_name

In [19]:
students_df

     Name  How_old?  Married     Sex
0  Victor        25   Single    Male
1  Martin        26  Married    Male
2   Linda        19   Maried  Female

In [20]:
Linda = ['Linda','19','Maried','Female']

In [21]:
Linda[1] = 34
Linda

['Linda', 34, 'Maried', 'Female']

In [22]:
# insert a record in a specific position in a list object
Linda.insert(-1,'Banker')
Linda

['Linda', 34, 'Maried', 'Banker', 'Female']

In [23]:
Linda[:3]

['Linda', 34, 'Maried']

#Read the first 2 rows

In [25]:
#Method 1 using head method
students_df.head(2)

     Name  How_old?  Married   Sex
0  Victor        25   Single  Male
1  Martin        26  Married  Male

In [26]:
#Method 2 using index position (row:column) iloc(index location)
students_df.iloc[:2,:2]

     Name  How_old?
0  Victor        25
1  Martin        26

In [27]:
students_df.tail(2)

     Name  How_old?  Married     Sex
1  Martin        26  Married    Male
2   Linda        19   Maried  Female

### Dictionaries

In [29]:
 # Dictionaries are key value pairs- every object has a key and a value

 How to create a Dictionary

In [31]:
Linda

['Linda', 34, 'Maried', 'Banker', 'Female']

In [32]:
unique_Linda = set(Linda)
unique_Linda

{34, 'Banker', 'Female', 'Linda', 'Maried'}

In [33]:
Linda_the_dictionary ={'Age': 19,'Occupation': 'Banker','Gender':'Female','First_name': 'Linda','Marital_Status':'Married'}

In [34]:
Linda_the_dictionary

{'Age': 19,
 'Occupation': 'Banker',
 'Gender': 'Female',
 'First_name': 'Linda',
 'Marital_Status': 'Married'}

In [35]:
type(Linda_the_dictionary)

dict

In [36]:
students

[['Victor', 25, 'Single', 'Male'],
 ['Martin', 26, 'Married', 'Male'],
 ['Linda', 19, 'Maried', 'Female']]

In [37]:
students_dict ={'Name': 'Victor','Age': '25','Marital_Status':'Single','Gender':'Male'}
students_dict

{'Name': 'Victor', 'Age': '25', 'Marital_Status': 'Single', 'Gender': 'Male'}

In [38]:
students_dict = [
                  {'Name': 'Victor','Age': '25','Marital_Status':'Single','Gender':'Male'},
                   {'Name': 'Martin','Age': '26','Marital_Status':'Married','Gender':'Male'},
                   {'Name': 'Linda','Age': '19','Marital_Status':'Married','Gender':'Female'}
                ]
students_dict

[{'Name': 'Victor', 'Age': '25', 'Marital_Status': 'Single', 'Gender': 'Male'},
 {'Name': 'Martin',
  'Age': '26',
  'Marital_Status': 'Married',
  'Gender': 'Male'},
 {'Name': 'Linda',
  'Age': '19',
  'Marital_Status': 'Married',
  'Gender': 'Female'}]